## List

In [1]:
a = [1,2,'s', [1,2,3]]
a[-1]

[1, 2, 3]

In [2]:
a[0]

1

In [3]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

In [4]:
sum(a)

25

In [7]:
for i in range(len(a)):
    #print(i)
    print(a[i] * b[i])

2
12
30
56
90

In [8]:
#zip
zip(a,b)

In [9]:
for rec in zip(a,b):
    print(rec)

(1, 2)
(3, 4)
(5, 6)
(7, 8)
(9, 10)

In [11]:
i,j = (1, 2)
i
j

2

In [13]:
for i,j in zip(a,b):
    #print(i,j)
    print(i * j)

2
12
30
56
90

In [14]:
# non-pythonic
ary = []
for i,j in zip(a,b):
    ary.append(i * j)
ary

[2, 12, 30, 56, 90]

## Pythonic
- 讓你寫的程式更加 Python
- 讓程式碼變得簡潔易懂
- https://wuzhiwei.net/be_pythonic/

In [16]:
# pythonic
[i*j for i,j in zip(a,b)]

[2, 12, 30, 56, 90]

## Numpy

In [17]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

In [18]:
import numpy as np
na = np.array(a)
na

array([1, 3, 5, 7, 9])

In [19]:
type(a)

list

In [20]:
type(na)

numpy.ndarray

In [21]:
import numpy as np
nb = np.array(b)
nb

array([ 2,  4,  6,  8, 10])

In [22]:
na + nb

array([ 3,  7, 11, 15, 19])

In [23]:
na - nb

array([-1, -1, -1, -1, -1])

In [24]:
na * nb

array([ 2, 12, 30, 56, 90])

In [25]:
na / nb

array([0.5       , 0.75      , 0.83333333, 0.875     , 0.9       ])

In [26]:
a.append('s')
a

[1, 3, 5, 7, 9, 's']

In [27]:
na.append

AttributeError: 'numpy.ndarray' object has no attribute 'append'

In [28]:
c = [1,2,3,'s', 'q']
np.array(c)

array(['1', '2', '3', 's', 'q'], dtype='<U11')

In [29]:
import numpy as np
my_list = [1,2,3]
np.array(my_list)

array([1, 2, 3])

In [30]:
my_matrix =[
    [1,2,3],
    [4,5,6],
    [7,8,9]]
np.array(my_matrix)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [33]:
#產生數列
print(np.arange(0,10))
print(np.arange(0,11,2))

[0 1 2 3 4 5 6 7 8 9]
[ 0  2  4  6  8 10]

In [34]:
#產生0與1
print(np.zeros(3))
print(np.zeros((5,5)))
print(np.ones(3))
print(np.ones((3,3)))

[0. 0. 0.]
[[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]
[1. 1. 1.]
[[1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]]

In [35]:
#根據給定範圍產生數列
print(np.linspace(0,10,3))
print(np.linspace(0,10,50))

[ 0.  5. 10.]
[ 0.          0.20408163  0.40816327  0.6122449   0.81632653  1.02040816
  1.2244898   1.42857143  1.63265306  1.83673469  2.04081633  2.24489796
  2.44897959  2.65306122  2.85714286  3.06122449  3.26530612  3.46938776
  3.67346939  3.87755102  4.08163265  4.28571429  4.48979592  4.69387755
  4.89795918  5.10204082  5.30612245  5.51020408  5.71428571  5.91836735
  6.12244898  6.32653061  6.53061224  6.73469388  6.93877551  7.14285714
  7.34693878  7.55102041  7.75510204  7.95918367  8.16326531  8.36734694
  8.57142857  8.7755102   8.97959184  9.18367347  9.3877551   9.59183673
  9.79591837 10.        ]

In [36]:
#建立對角矩陣
np.eye(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [37]:
#產生隨機數列
print(np.random.rand(2))
print(np.random.rand(5,5))
print(np.random.randn(2))
print(np.random.randn(5,5))
print(np.random.randint(1,100))
print(np.random.randint(1,100,10))

[0.54025469 0.39220051]
[[0.22047301 0.13679313 0.20325913 0.29446747 0.40651337]
 [0.96416388 0.61450312 0.34694298 0.54118807 0.06288507]
 [0.84949205 0.4280758  0.29872539 0.6313622  0.33561524]
 [0.84822611 0.1274028  0.50279934 0.98128869 0.84926731]
 [0.64840982 0.36135711 0.05812937 0.05483077 0.43660737]]
[-0.12262512  0.11416727]
[[-1.77012684  0.33759801  0.16026085 -0.59443665 -1.69745573]
 [ 0.31631637  0.16487856  0.52553068 -1.15736664  0.47064763]
 [ 1.12733928  1.25985599 -0.9255871  -0.01315341  0.77880871]
 [ 0.91793008  0.78848521 -0.47168439  1.18417202 -1.18449698]
 [ 1.83931159 -0.75315913  0.2581192   0.19937958 -0.85191034]]
1
[15  8 69 61  9 49 96 30 44  8]

In [39]:
#重塑陣列
arr = np.arange(25)
print(arr)
arr.reshape(5,5)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24]

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [40]:
ranarr =np.random.randint(0,50,10)
ranarr

array([25, 31, 15, 49, 38,  3, 11, 41, 26, 34])

In [41]:
#取得極值
print(ranarr.max())
print(ranarr.argmax())
print(ranarr.min())
print(ranarr.argmin())

49
3
3
5

In [42]:
#取得陣列維度
print(arr.shape)
print(arr.reshape(1,25))
print(arr.reshape(1,25).shape)
print(arr.reshape(25,1))
print(arr.reshape(25,1).shape)

(25,)
[[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
  24]]
(1, 25)
[[ 0]
 [ 1]
 [ 2]
 [ 3]
 [ 4]
 [ 5]
 [ 6]
 [ 7]
 [ 8]
 [ 9]
 [10]
 [11]
 [12]
 [13]
 [14]
 [15]
 [16]
 [17]
 [18]
 [19]
 [20]
 [21]
 [22]
 [23]
 [24]]
(25, 1)

In [43]:
#像List 一樣利用[]篩選資料
arr = np.arange(0,11)
print(arr)
print(arr[8])
print(arr[1:5])

[ 0  1  2  3  4  5  6  7  8  9 10]
8
[1 2 3 4]

In [44]:
#廣播 (Broadcasting)
arr = np.arange(0,11)
slice_of_arr = arr[0:6]
print(slice_of_arr)
slice_of_arr[:]=99
slice_of_arr

[0 1 2 3 4 5]

array([99, 99, 99, 99, 99, 99])

In [45]:
arr

array([99, 99, 99, 99, 99, 99,  6,  7,  8,  9, 10])

In [46]:
#二維資料取值
arr_2d = np.array(([5,10,15],[20,25,30],[35,40,45]))
print(arr_2d[1])
print(arr_2d[1][0])
print(arr_2d[1,0])
print(arr_2d[2])
print(arr_2d[2,:])

[20 25 30]
20
20
[35 40 45]
[35 40 45]

In [47]:
#用條件篩選資料
arr = np.arange(1,11)
arr > 4

array([False, False, False, False,  True,  True,  True,  True,  True,
        True])

In [48]:
bool_arr = arr>4
arr[bool_arr]

array([ 5,  6,  7,  8,  9, 10])

In [49]:
arr[arr>2]

array([ 3,  4,  5,  6,  7,  8,  9, 10])

In [50]:
# Numpy 計算
arr = np.arange(0,10)
print(arr + arr)
print(arr * arr)
print(arr - arr)
print(arr/arr)
print(1/arr)
print(arr**3)

[ 0  2  4  6  8 10 12 14 16 18]
[ 0  1  4  9 16 25 36 49 64 81]
[0 0 0 0 0 0 0 0 0 0]
[nan  1.  1.  1.  1.  1.  1.  1.  1.  1.]
[       inf 1.         0.5        0.33333333 0.25       0.2
 0.16666667 0.14285714 0.125      0.11111111]
[  0   1   8  27  64 125 216 343 512 729]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: RuntimeWarning: invalid value encountered in true_divide

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: RuntimeWarning: divide by zero encountered in true_divide
  import sys

In [51]:
# Numpy 內建計算函數
print(np.sqrt(arr))
print(np.exp(arr))
print(np.max(arr))
print(np.sin(arr))
print(np.log(arr))

[0.         1.         1.41421356 1.73205081 2.         2.23606798
 2.44948974 2.64575131 2.82842712 3.        ]
[1.00000000e+00 2.71828183e+00 7.38905610e+00 2.00855369e+01
 5.45981500e+01 1.48413159e+02 4.03428793e+02 1.09663316e+03
 2.98095799e+03 8.10308393e+03]
9
[ 0.          0.84147098  0.90929743  0.14112001 -0.7568025  -0.95892427
 -0.2794155   0.6569866   0.98935825  0.41211849]
[      -inf 0.         0.69314718 1.09861229 1.38629436 1.60943791
 1.79175947 1.94591015 2.07944154 2.19722458]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: RuntimeWarning: divide by zero encountered in log

In [52]:
na = np.array([
    ['frank', 'M', 29], 
    ['mary', 'F', 23], 
    ['tom', 'M',35], 
    ['ted', 'M', 33], 
    ['jean', 'F', 21], 
    ['lisa', 'F', 20]])
na

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U5')

In [55]:
na[:,2].astype(int).mean()

26.833333333333332

In [66]:
import numpy as np
na = np.array([['name', 'gender', 'age'], ['frank', 'M', 29],
               ['mary', 'F', 23], ['tom', 'M', 35],
               ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
na[1:,na[0] == 'age'].astype(int).flatten().mean()

26.833333333333332

## Pandas

In [67]:
import pandas as pd
df = pd.DataFrame([
    ['frank', 'M', 29], 
    ['mary', 'F', 23], 
    ['tom', 'M',35], 
    ['ted', 'M', 33], 
    ['jean', 'F', 21], 
    ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [68]:
df.columns=['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [70]:
df['age'].mean()

26.833333333333332

### Pandas Series

In [71]:
# 建立Series
import numpy as np
import pandas as pd

In [72]:
# 從List 建立Series
labels = ['a','b','c']
my_list = [10,20,30]

In [73]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [74]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [75]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [76]:
# 從Numpy Arrays 建立 Series
arr = np.array([10,20,30])
arr

array([10, 20, 30])

In [77]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [78]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [79]:
# 從Dictionary 建立 Series
d = {'a':10,'b':20,'c':30}
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [80]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4],index = ['USA','Germany','Italy', 'Japan'])

In [81]:
ser1['USA']

1

In [82]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

### Pandas DataFrame

In [84]:
import pandas as pd
df = pd.DataFrame([
    ['frank', 'M', 29], 
    ['mary', 'F', 23], 
    ['tom', 'M',35], 
    ['ted', 'M', 33], 
    ['jean', 'F', 21], 
    ['lisa', 'F', 20]])
df.columns = ['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [85]:
type(df)

pandas.core.frame.DataFrame

In [86]:
df['age']

0    29
1    23
2    35
3    33
4    21
5    20
Name: age, dtype: int64

In [87]:
type(df['age'])

pandas.core.series.Series

In [88]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted','M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]], 
                  columns = ['name', 'gender', 'age'])
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [90]:
df = pd.DataFrame([
    {'name':'frank','gender':'M', 'age':29}, \
{'name':'mary','gender':'F', 'age':23}, \
{'name':'tom','gender':'M', 'age':35}, \
{'name':'ted','gender':'M', 'age':33}, \
{'name':'jean','gender':'F', 'age':21}, \
{'name':'lisa','gender':'F', 'age':20}])
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [91]:
df2 = pd.DataFrame([
    {'name':'frank','gender':'M', 'age':29}, \
{'name':'mary','gender':'F'}])
df2

    age gender   name
0  29.0      M  frank
1   NaN      F   mary

In [92]:
df.head()

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [94]:
?df.head

In [95]:
df.head(3)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom

In [93]:
df.tail()

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted
4   21      F  jean
5   20      F  lisa

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
age       6 non-null int64
gender    6 non-null object
name      6 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [98]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [99]:
df.dtypes

age        int64
gender    object
name      object
dtype: object

In [100]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [101]:
df[['name', 'age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [102]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [103]:
df[df['gender'] == 'M']

   age gender   name
0   29      M  frank
2   35      M    tom
3   33      M    ted

In [104]:
df[(df['gender'] == 'M') & (df['age'] >= 30) ]

   age gender name
2   35      M  tom
3   33      M  ted

In [105]:
df[(df['gender'] == 'M') | (df['age'] >= 30) ]

   age gender   name
0   29      M  frank
2   35      M    tom
3   33      M    ted

In [106]:
df['employee'] = True
df

   age gender   name  employee
0   29      M  frank      True
1   23      F   mary      True
2   35      M    tom      True
3   33      M    ted      True
4   21      F   jean      True
5   20      F   lisa      True

In [107]:
del df['employee']

In [108]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [109]:
df['employee']= True

In [111]:
# axis = 0 => 列
# axis = 1 => 欄
df.drop('employee', axis = 1)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [112]:
df

   age gender   name  employee
0   29      M  frank      True
1   23      F   mary      True
2   35      M    tom      True
3   33      M    ted      True
4   21      F   jean      True
5   20      F   lisa      True

In [113]:
df.drop('employee', axis = 1, inplace=True)
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [114]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [116]:
df.loc[6] =  {'age':20,'gender':'F','name':'qoo'}
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
6   20      F    qoo

In [119]:
df.drop(6, axis = 0, inplace=True)

In [120]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [121]:
df.index

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [122]:
df['userid'] = range(101,107)
df

   age gender   name  userid
0   29      M  frank     101
1   23      F   mary     102
2   35      M    tom     103
3   33      M    ted     104
4   21      F   jean     105
5   20      F   lisa     106

In [125]:
df.set_index('userid', inplace=True)

In [126]:
df

        age gender   name
userid
101      29      M  frank
102      23      F   mary
103      35      M    tom
104      33      M    ted
105      21      F   jean
106      20      F   lisa

In [127]:
# 根據索引名稱取值
df.loc[102]

age         23
gender       F
name      mary
Name: 102, dtype: object

In [130]:
df.loc[[102,104,106]]

        age gender  name
userid
102      23      F  mary
104      33      M   ted
106      20      F  lisa

In [131]:
df.loc[[102,104,106], ['gender','name'] ]

       gender  name
userid
102         F  mary
104         M   ted
106         F  lisa

In [128]:
# 根據位置取值
df.iloc[1]

age         23
gender       F
name      mary
Name: 102, dtype: object

In [129]:
df.iloc[[1,3,5]]

        age gender  name
userid
102      23      F  mary
104      33      M   ted
106      20      F  lisa

In [133]:
df.iloc[[1,3,5], [1,2] ]

       gender  name
userid
102         F  mary
104         M   ted
106         F  lisa

In [135]:
df.iloc[[1,3,5]][['gender', 'name']]

       gender  name
userid
102         F  mary
104         M   ted
106         F  lisa